OdIfcHostAppServices.getTexturesCreationType
\details
Retrieves textures make method.
\returns Returns textures make method.
\remarks
This experimental functionality is turned off by default.

OdIfcHostAppServices.setTexturesCreationType(OdIfcHostAppServices.TexturesType)
\details
Sets textures make method when ifc file creating.
\param texturesType [in] The type of textures make method.
\remarks
This experimental functionality is turned off by default.

OdIfcHostAppServices.getTexturesVisibility
\details
Retrieves textures visibility option.
\returns Returns true if textures are visible; otherwise false.
\remarks
This experimental functionality is turned off by default.

OdIfcHostAppServices.setTexturesVisibility(System.Boolean)
\details
Switch textures visibility.
\param isTexturesVisible [in] If parameter is true textures are visible; otherwise invisible.
\remarks
This experimental functionality is turned off by default.

OdIfcHostAppServices.brepBuilder(OdBrepBuilder*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,BrepType)
\details
Global setting of B-Rep triangulation.
\details
Global setting of B-Rep triangulation.
\details
Initializes the boundary representation builder with a product-specific implementation.
\param bbuilder [out] A reference to an instance of the boundary representation builder class to be initialized.
\param bbType   [in]  A type of boundary representation.
\returns eOk if the B-Rep builder was successfully initialized; otherwise the method returns an appropriate error code.
\remarks
The method returns eNotImplementedYet value by default.

OdIfcHostAppServices.gsBitmapDevice(OdRxObject*,OdRxObject*,System.UInt32!System.Runtime.CompilerServices.IsLong)
\details
Retrieves the current bitmap device
associated with the host application services object.
\param pViewObj [in] A raw pointer to an OdAbstractViewPE compatible object
(OdGsView, OdDbViewport, etc).
\param pDb      [in] A raw pointer to the database context.
\param flags    [in] Bitmap device flags.
\returns a smart pointer to the device object associated with the host application services object.

OdIfcHostAppServices.getSubstituteFontByChar(OdFont!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,System.UInt16,OdRxObject*)
\details
Retrieves the typeface name of the TTF font that has the specified character.
\param pFont        [in] A TTF font object.
\param unicodeChar  [in] A symbol to find in the substitute font name.
\param pDb          [in] A raw pointer to the database context.
\returns a string object that contains the substitute font name.
\remarks
The default method implementation uses the Windows API for getting the font.
\sa
Font Handling

OdIfcHostAppServices.getSubstituteFont(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdTagFontType)
\details
Retrieves the current substitute font name. The substitute font is used in cases when a specified font is not found.
\param fontName [in] A font name.
\param fontType [in] A font type.
\returns a string object that contains the substitute font name.
\remarks
The default implementation of this method returns an empty string.
The fontType parameter value must be one of the following:
Name                    Value    Description
kFontTypeUnknown        0        Unknown.
kFontTypeShx            1        SHX font.
kFontTypeTrueType       2        TrueType font.
kFontTypeShape          3        Shape file.
kFontTypeBig            4        BigFont file.
\sa
Font Handling

OdIfcHostAppServices.getPreferableFont(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdTagFontType)
\details
Retrieves the current preferable font name for a specified font name and type.
\param fontName [in] A font name.
\param fontType [in] A font type.
\returns a string object containing the preferable font name.
\remarks
The default implementation of this method returns an empty string.
The fontType parameter value must be one of the following:
Name                    Value    Description
kFontTypeUnknown        0        Unknown.
kFontTypeShx            1        SHX font.
kFontTypeTrueType       2        TrueType font.
kFontTypeShape          3        Shape file.
kFontTypeBig            4        BigFont file.
\sa
Font Handling

OdIfcHostAppServices.getAlternateFontName
\details
Retrieves the current default font name.
\returns the path to the font file to be used when a given font file can not be found by IFC SDK.
\remarks
The default implementation of the method returns an empty string.
\sa
Font Handling

OdIfcHostAppServices.formatMessage(System.UInt32,BTEllipsis)
details
Formats an error message string corresponding to the specified error code(s).
\param errorCode [in] An error code.
\returns A string with a formatted error message.

OdIfcHostAppServices.companyName
\details
Retrieves the current name of the client company.
\returns A string object containing the current name of the client company.
\remarks
The default implementation of this method returns the result returned by the oddgGetLibraryInfo()->getCompanyName().
This method is typically used for populating information about the client's company.

OdIfcHostAppServices.product
\details
Retrieves the current name of the client product based on ODA IFC SDK.
\returns A string object containing the current name of the client product.
\remarks
The default implementation of this method returns the result of the program() method.
This method is typically used for populating information about the product.

OdIfcHostAppServices.program
\details
Retrieves the current name of the client program based on ODA IFC SDK.
\returns A string object containing the custom application name.
\remarks
The default implementation of this method returns oddgGetLibraryInfo()->getLibName().
This method is typically used for populating information about the application.

OdIfcHostAppServices.findFile(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdRxObject*,OdDbBaseHostAppServices.FindFileHint)
\details
Searches for a specified file.
\param filename [in] A name of the file to find.
\param pDb      [in] A pointer to the database context. If the parameter value is equal to NULL, the file search is not related to a database.
\param hint     [in] A hint that indicates the type of file that is required.
\returns The full path to the found file; if the file was not found, the method returns an empty string.
\remarks
This method is called by IFC SDK when it needs to get access to a file, such as a font file, a template file, etc.
If the pointer to the database context is not equal to NULL, it is possible to call the getFilename() method of the database instance
to determine the full path to the IFC file associated with the database.
The typical search order is the following:
# The file name itself.
# The current directory.
# The drawing directory (for SHX font, image, and xref files).
# The Windows fonts directory (only for TTF fonts on Windows platforms).
The hint parameter's value must be one of the following:
Name                    Value     Description Extension
kDefault                0         Any file.                         any
kFontFile               1         Can be either SHX or TTF file.    SHX or TTF
kCompiledShapeFile      2         SHX file.                         SHX
kTrueTypeFontFile       3         TTF file.                         TTF
kEmbeddedImageFile      4         Image file.                       ISM
kXRefDrawing            5         External reference file.
kPatternFile            6         Pattern file (PAT).               PAT
kDRXApplication         7         DRX application file.             DRX
kFontMapFile            8         FontMap file.                     FMP

OdIfcHostAppServices.#ctor
\details
Creates a platform-specific operation services object for IFC functionality.

OdIfcHostAppServices
\details
The class that implements for platform-specific operations within the IFC SDK.